Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldPreparationTypeEnum Enumeration
 Weld preparation types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldPreparationTypeEnum
Public Enumeration WeldPreparationTypeEnum
Members
Member name | Value | Description
PREPARATION_NONE | 0 |  No preparation.
PREPARATION_AUTO | 1 |  Auto preparation.
PREPARATION_MAIN | 2 |  Main part preparation.
PREPARATION_SECONDARY | 3 |  Secondary part preparation.
See Also
Reference
Tekla.Structures.Model Namespace